GopalSaraf/Practicals/PSDL/include/proc/pic16f18046.h
// Register: TMR3H
#define TMR3H TMR3H
extern volatile unsigned char           TMR3H               __at(0x293);
#ifndef _LIB_BUILD
asm("TMR3H equ 0293h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3H                  :8;
    };
    struct {
        unsigned TMR3H0                 :1;
        unsigned TMR3H1                 :1;
        unsigned TMR3H2                 :1;
        unsigned TMR3H3                 :1;
        unsigned TMR3H4                 :1;
        unsigned TMR3H5                 :1;
        unsigned TMR3H6                 :1;
        unsigned TMR3H7                 :1;
    };
    struct {
        unsigned TMR38                  :1;
        unsigned TMR39                  :1;
        unsigned TMR310                 :1;
        unsigned TMR311                 :1;
        unsigned TMR312                 :1;
        unsigned TMR313                 :1;
        unsigned TMR314                 :1;
        unsigned TMR315                 :1;
    };
} TMR3Hbits_t;
extern volatile TMR3Hbits_t TMR3Hbits __at(0x293);
// bitfield macros
#define _TMR3H_TMR3H_POSN                                   0x0
#define _TMR3H_TMR3H_POSITION                               0x0
#define _TMR3H_TMR3H_SIZE                                   0x8
#define _TMR3H_TMR3H_LENGTH                                 0x8
#define _TMR3H_TMR3H_MASK                                   0xFF
#define _TMR3H_TMR3H0_POSN                                  0x0
#define _TMR3H_TMR3H0_POSITION                              0x0
#define _TMR3H_TMR3H0_SIZE                                  0x1
#define _TMR3H_TMR3H0_LENGTH                                0x1
#define _TMR3H_TMR3H0_MASK                                  0x1
#define _TMR3H_TMR3H1_POSN                                  0x1
#define _TMR3H_TMR3H1_POSITION                              0x1
#define _TMR3H_TMR3H1_SIZE                                  0x1
#define _TMR3H_TMR3H1_LENGTH                                0x1
#define _TMR3H_TMR3H1_MASK                                  0x2
#define _TMR3H_TMR3H2_POSN                                  0x2
#define _TMR3H_TMR3H2_POSITION                              0x2
#define _TMR3H_TMR3H2_SIZE                                  0x1
#define _TMR3H_TMR3H2_LENGTH                                0x1
#define _TMR3H_TMR3H2_MASK                                  0x4
#define _TMR3H_TMR3H3_POSN                                  0x3
#define _TMR3H_TMR3H3_POSITION                              0x3
#define _TMR3H_TMR3H3_SIZE                                  0x1
#define _TMR3H_TMR3H3_LENGTH                                0x1
#define _TMR3H_TMR3H3_MASK                                  0x8
#define _TMR3H_TMR3H4_POSN                                  0x4
#define _TMR3H_TMR3H4_POSITION                              0x4
#define _TMR3H_TMR3H4_SIZE                                  0x1
#define _TMR3H_TMR3H4_LENGTH                                0x1
#define _TMR3H_TMR3H4_MASK                                  0x10
#define _TMR3H_TMR3H5_POSN                                  0x5
#define _TMR3H_TMR3H5_POSITION                              0x5
#define _TMR3H_TMR3H5_SIZE                                  0x1
#define _TMR3H_TMR3H5_LENGTH                                0x1
#define _TMR3H_TMR3H5_MASK                                  0x20
#define _TMR3H_TMR3H6_POSN                                  0x6
#define _TMR3H_TMR3H6_POSITION                              0x6
#define _TMR3H_TMR3H6_SIZE                                  0x1
#define _TMR3H_TMR3H6_LENGTH                                0x1
#define _TMR3H_TMR3H6_MASK                                  0x40
#define _TMR3H_TMR3H7_POSN                                  0x7
#define _TMR3H_TMR3H7_POSITION                              0x7
#define _TMR3H_TMR3H7_SIZE                                  0x1
#define _TMR3H_TMR3H7_LENGTH                                0x1
#define _TMR3H_TMR3H7_MASK                                  0x80
#define _TMR3H_TMR38_POSN                                   0x0
#define _TMR3H_TMR38_POSITION                               0x0
#define _TMR3H_TMR38_SIZE                                   0x1
#define _TMR3H_TMR38_LENGTH                                 0x1
#define _TMR3H_TMR38_MASK                                   0x1
#define _TMR3H_TMR39_POSN                                   0x1
#define _TMR3H_TMR39_POSITION                               0x1
#define _TMR3H_TMR39_SIZE                                   0x1
#define _TMR3H_TMR39_LENGTH                                 0x1
#define _TMR3H_TMR39_MASK                                   0x2
#define _TMR3H_TMR310_POSN                                  0x2
#define _TMR3H_TMR310_POSITION                              0x2
#define _TMR3H_TMR310_SIZE                                  0x1
#define _TMR3H_TMR310_LENGTH                                0x1
#define _TMR3H_TMR310_MASK                                  0x4
#define _TMR3H_TMR311_POSN                                  0x3
#define _TMR3H_TMR311_POSITION                              0x3
#define _TMR3H_TMR311_SIZE                                  0x1
#define _TMR3H_TMR311_LENGTH                                0x1
#define _TMR3H_TMR311_MASK                                  0x8
#define _TMR3H_TMR312_POSN                                  0x4
#define _TMR3H_TMR312_POSITION                              0x4
#define _TMR3H_TMR312_SIZE                                  0x1
#define _TMR3H_TMR312_LENGTH                                0x1
#define _TMR3H_TMR312_MASK                                  0x10
#define _TMR3H_TMR313_POSN                                  0x5
#define _TMR3H_TMR313_POSITION                              0x5
#define _TMR3H_TMR313_SIZE                                  0x1
#define _TMR3H_TMR313_LENGTH                                0x1
#define _TMR3H_TMR313_MASK                                  0x20
#define _TMR3H_TMR314_POSN                                  0x6
#define _TMR3H_TMR314_POSITION                              0x6
#define _TMR3H_TMR314_SIZE                                  0x1
#define _TMR3H_TMR314_LENGTH                                0x1
#define _TMR3H_TMR314_MASK                                  0x40
#define _TMR3H_TMR315_POSN                                  0x7
#define _TMR3H_TMR315_POSITION                              0x7
#define _TMR3H_TMR315_SIZE                                  0x1
#define _TMR3H_TMR315_LENGTH                                0x1
#define _TMR3H_TMR315_MASK                                  0x80

// Register: T3CON
#define T3CON T3CON
extern volatile unsigned char           T3CON               __at(0x294);
#ifndef _LIB_BUILD
asm("T3CON equ 0294h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned TMR3ON                 :1;
        unsigned T3RD16                 :1;
        unsigned nT3SYNC                :1;
        unsigned                        :1;
        unsigned T3CKPS0                :1;
        unsigned T3CKPS1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD163                  :1;
    };
} T3CONbits_t;
